---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsPathType.StartSymbolTypeId
source: html/9d3eb283-4348-8330-99f9-6440074e7aaf.htm
---
# Autodesk.Revit.DB.Architecture.StairsPathType.StartSymbolTypeId Property

The start symbol type of stairs path.

## Syntax (C#)
```csharp
public ElementId StartSymbolTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The startSymbolTypeId is not a valid start symbol type.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null